Revit 2027 API
ElectricalSystem.SetCircuitPath Method
 Sets the electrical system circuit path by the list of node position.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCircuitPath(
	IList<XYZ> nodes
)
Public Sub SetCircuitPath (
	nodes As IList(Of XYZ)
)
public:
void SetCircuitPath(
	IList<XYZ^>^ nodes
)
member SetCircuitPath :
        nodes : IList<XYZ> -> unit
Parameters
nodes IList<XYZ>
 The list of the circuit path node position.
Exceptions
Exception | Condition
ArgumentException |  The list of the electrical system circuit path node position is not valid. The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical. Also note that the first node position should be the position of the connector (the one connects to the circuit) of the panel, but not the origin of the panel instance.
ArgumentNullException |  A non-optional argument was null
Remarks
 If succeed, it will also change the CircuitPathMode property to Custom mode implicitly.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace